[{"phrasalVerb":"Break down","meaning":"To stop working/ to become very emotional / to analyze in detail/ to physically collapse","sentences":["The car ............... (simple past) on the highway during rush hour.","She ............... (simple past) when she heard the shocking news.","The data needs to ............... (simple present) into categories for analysis.","He completely ............... (simple past) after failing the exam for the third time.","The old bridge has started to ............... (present continuous) after years of neglect.","The negotiations ............... (simple past) after both sides refused to compromise."]},{"phrasalVerb":"Bring back","meaning":"To cause someone to remember/To return something/To reintroduce","sentences":["She promised to ............... (simple present) the book after finishing it.","That song always ............... (simple present) memories of our trip to the beach.","The company plans to ............... (simple future) the classic flavor that was discontinued last year.","The coach decided to ............... (simple past) the old training routine.","The trip to his hometown ............... (simple past) many childhood memories.","We should ............... (simple present) the tradition of family dinners every Sunday."]},{"phrasalVerb":"Bring up","meaning":"To mention or introduce /To raise a child or nurture someone/To vomit","sentences":["During the meeting, he ............... (simple past) the issue of budget cuts.","She tends to ............... (simple present) the same topic every time we meet.","Her parents worked hard to ............... (simple past) her with strong values.","I didn’t mean to ............... (simple present) such a sensitive subject.","After the long meal, he ............... (simple past) from overeating.","They decided to ............... (simple present) the proposal at the next team meeting."]},{"phrasalVerb":"Call off","meaning":"To cancel or postpone/ To stop or end an action or behavior","sentences":["Due to the rain, the coach ............... (simple past) the outdoor practice.","The meeting ............... (simple past) at the last minute because of an urgent issue.","The concert has been ............... (simple past) due to the storm.","They decided to ............... (simple past) the search after finding the missing hiker.","We had to ............... (simple past) the event when the guest speaker canceled.","The police officer ............... (simple past) the chase when the suspect entered a crowded area."]},{"phrasalVerb":"Come across","meaning":"To find something by chance/To appear or seem in a certain way to others. ","sentences":["I ............... (simple past) an old letter from my grandmother while cleaning out the attic.","He ............... (simple present) as a very confident person in interviews.","While hiking, they ............... (simple past) a beautiful hidden lake","She ............... (simple past) some useful information while browsing the internet.","I hope I didn’t ............... (simple present) rude during the meeting.","The team ............... (simple past) a great opportunity to work with the new company."]},{"phrasalVerb":"Come up","meaning":"To arise or occur (often used for ideas, problems, or events)./To approach (e.g., moving closer to a person or place)./ To achieve or reach (in terms of goals or success).","sentences":["A great idea ............... (simple past) during the brainstorming session.","The opportunity ............... (simple past) when we least expected it.","We have to figure out how to ............... (simple present) with a solution.","The problem ............... (simple past) unexpectedly while we were working.","She ............... (simple present) with a brilliant suggestion at the meeting.","As we walked down the street, a man ............... (simple past) and offered help."]},{"phrasalVerb":"Cut off","meaning":"To isolate or separate from a group or place./To stop or interrupt something or someone./To remove or sever something by cutting it. ","sentences":["They ............... (simple past) the tree to make room for the new building.","The phone call ............... (simple past) when we were halfway through the conversation.","The storm ............... (simple past) the village from the rest of the town.","The teacher ............... (simple past) the student in the middle of the explanation for being disruptive.","They ............... (simple past) the power to the house when the wires became unsafe.","The town ............... (simple past) all connections to the outside world during the emergency."]},{"phrasalVerb":"Cut out","meaning":"To remove something from a larger whole (e.g., cutting a part out of something)./ To stop or eliminate an activity, behavior, or habit./ To be suited for a particular task or role (informally used).","sentences":["She ............... (simple past) the mistakes from the report before submitting it.","He ............... (simple past) all the sugary snacks from his diet for better health.","The doctor advised him to ............... (simple present) smoking completely.","I think you’re really ............... (simple present) for this job; you have the right skills.","They ............... (simple past) the scene from the movie because it was too violent.","The company had to ............... (simple past) the extra expenses to save money."]},{"phrasalVerb":"Get away","meaning":"To escape or leave a place, especially to avoid something or someone./ To go on vacation or take a break /To succeed in avoiding punishment or consequences for something.","sentences":["The thief ............... (simple past) before the police arrived.","They ............... (simple past) to the beach for the weekend to relax.","She ............... (simple past) with not paying the fine because of a mistake in the system.","We’re planning to ............... (simple present) for a few days next month to recharge.","I can't believe he ............... (simple past) with lying to the manager.","The weather was so nice, we decided to ............... (simple present) and enjoy the sun."]},{"phrasalVerb":"Get over","meaning":"To recover from an illness, setback, or emotional difficulty/To overcome a problem or challenge. /To move past something or stop thinking about it.","sentences":["It took her a long time to ............... (simple past) the loss of her pet.","He still hasn’t ............... (present perfect) the shock from the accident.","After the argument, it took a while for them to ............... (simple past) their differences.","She’s trying to ............... (present continuous) the disappointment of not getting the job.","He finally ............... (simple past) his fear of public speaking.","I hope I can ............... (simple present) this challenge without too much stress."]},{"phrasalVerb":"Get through","meaning":"To contact someone, typically by phone./ To successfully complete or overcome a difficult situation./ To pass or succeed in something like a test or process.","sentences":["She ............... (simple past) the difficult interview and got the job.","We ............... (simple past) to the office after several attempts, but no one answered.","It was a tough year, but we managed to ............... (simple past) it.","He ............... (simple present) to the other side of the mountain after hours of hiking.","I hope I ............... (simple future) the exam with good results.","It’s hard to ............... (simple present) to him when he’s always so busy."]},{"phrasalVerb":"Go against","meaning":"To oppose or resist something or someone./ To act in a way that is contrary to a rule, expectation, or norm.","sentences":["He decided to ............... (simple past) the company's policy and speak out against it.","The team ............... (simple past) the decision to cut funding for their project.","She always tries to ............... (simple present) the rules to make her own path.","They ............... (simple past) their parents’ wishes by choosing a different career.","The proposal seems to ............... (simple present) the best interests of the community.","They ............... (simple past) the advice they were given and ended up regretting it."]},{"phrasalVerb":"Go down","meaning":"To decrease or decline (in value, quality, or level)./To happen or occur (used for events or incidents)./To descend or move downward (physically).","sentences":["The stock prices ............... (simple past) after the announcement of the new policy.","The temperature ............... (simple past) significantly during the night.","The meeting ............... (simple past) as planned despite the stormy weather.","I watched the plane ............... (simple past) smoothly during its descent.","He thinks the situation will ............... (simple future) if they don’t act quickly.","The concert ............... (simple past) in history as one of the greatest performances."]},{"phrasalVerb":"Look after","meaning":"To take care of or look after someone or something./ To be responsible for the well-being of someone or something.","sentences":["She ............... (simple past) her younger brother while their parents were away.","They ............... (simple present) the elderly patients at the nursing home.","I need to ............... (simple present) my garden while I'm on vacation.","He ............... (simple past) his sick dog all weekend.","We’re trying to ............... (simple future) the house while it's being renovated.","The teacher ............... (simple past) the students during the field trip."]},{"phrasalVerb":"Look down","meaning":"To look at something below or lower than you./To treat someone or something with disrespect or condescension.","sentences":["She ............... (simple past) at the ground as she walked through the park.","He always ............... (simple present) on others who don’t share his opinions.","The bird ............... (simple past) from the tree and flew away.","I could see the car ............... (simple present) from the top of the hill.","They ............... (simple past) on their coworkers for not working as hard as they did.","He ............... (simple past) to check the steps before stepping off the ladder."]},{"phrasalVerb":"Make out","meaning":"To understand or discern something, often with difficulty./To kiss passionately or engage in intimate behavior (informally)./  To write out or complete something, like a document or check.","sentences":["I couldn’t ............... (simple past) what he was trying to say because of the noise.","She ............... (simple past) the form with all the necessary details.","We couldn’t ............... (simple past) his handwriting, it was too messy.","They ............... (simple present) under the stars all night during the concert.","I need to ............... (simple future) the check before sending it to the bank","It’s hard to ............... (simple present) what he means when he speaks so quickly."]},{"phrasalVerb":"Sort out","meaning":"To organize/ to resolve","sentences":["She ............... (simple past) the documents into separate folders for each client.","They need to ............... (simple present) their financial issues before the end of the month.","He ............... (simple past) the misunderstanding with his friend after their argument.","We’re trying to ............... (present continuous) the details for the event next week.","The teacher ............... (simple past) the conflict between the two students calmly.","I hope they can ............... (simple future) this issue without too much trouble."]},{"phrasalVerb":"Take down","meaning":"To write down or record information./To dismantle or remove something from a higher position./  To defeat or bring down someone, typically in a competition or confrontation.","sentences":["He ............... (simple past) all the notes during the meeting.","They ............... (simple past) the decorations after the party.","The police ............... (simple past) the suspect after a long chase.","I need to ............... (simple present) the address before I forget it.","She ............... (simple past) the old bookshelf and put it in the garage.","The team ............... (simple past) their rivals in the championship game."]},{"phrasalVerb":"Take off","meaning":"To remove something, especially clothing or accessories./ To remove something, especially clothing or accessories./ To become successful or gain momentum quickly.","sentences":["She ............... (simple past) her jacket as soon as she entered the warm room.","The plane ............... (simple past) smoothly despite the weather.","The new business ............... (simple past) after just a few months of operation.","I need to ............... (simple present) my shoes before entering the house.","The rocket ............... (simple past) into the sky early this morning.","His career ............... (simple past) after his first major movie role."]},{"phrasalVerb":"Turn up ","meaning":"To appear or arrive, especially unexpectedly or after a delay./To increase the intensity, volume, or level of something/To be found after being lost or missing.","sentences":["He ............... (simple past) late to the meeting but still managed to contribute.","The music ............... (simple past) so loud that it woke up the neighbors.","The missing keys ............... (simple past) in the drawer after hours of searching.","Can you ............... (simple present) the heat? It's getting cold in here.","She ............... (simple past) at the party just in time for the cake.","I hope my luggage ............... (simple future) soon."]}]